Revit 2027 API
ImageExportOptions.ZoomType Property
 The zoom type, which defines how the image size is determined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ZoomFitType ZoomType { get; set; }
Public Property ZoomType As ZoomFitType
	Get
	Set
public:
property ZoomFitType ZoomType {
	ZoomFitType get ();
	void set (ZoomFitType value);
}
member ZoomType : ZoomFitType with get, set
Property Value
ZoomFitType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 The default is FitToPage.
See Also
Reference
ImageExportOptions Class
Autodesk.Revit.DB Namespace